WolfBoy55014/RP2040-Scheduler/src/scheduler.c
#include <stdlib.h>
#include <stdio.h>

#include "hardware/clocks.h"
#include "hardware/gpio.h"
#include "pico/time.h"
#include "hardware/sync.h"
#include "hardware/structs/systick.h"
#include "pico/multicore.h"

#include "scheduler_internal.h"
#include "scheduler.h"

#include <string.h>

#include "channel_internal.h"
#include "governor.h"
#include "spinlock_internal.h"
#include "kernel_config.h"
#include "RP2040.h"

/* Scheduler Variables */
scheduler_t schedulers[CORE_COUNT];
uint32_t num_tasks;
task_t tasks[MAX_TASKS];
#if PROFILE_SCHEDULER
scheduler_profile_t profile;
#endif

/* Public Assembly Functions */
__attribute__((noinline))
extern void set_spsel(uint32_t control);

extern bool task_exists_no_lock(uint32_t pid);

__attribute__((noinline))
scheduler_t* get_scheduler() {
    return &schedulers[CORE_NUM];
}

__attribute__((noinline))
task_t* get_current_task() {
    scheduler_t* scheduler = get_scheduler();
    return scheduler->current_task;
}

__attribute__((noinline))
bool scheduler_is_started() {
    return get_scheduler()->started;
}

__attribute__((noinline))
void set_scheduler_started(bool started) {
    get_scheduler()->started = started;
}

void calculate_cpu_usage() {
    const uint32_t saved_irq = scheduler_spin_lock();

#if CPU_FANCY_USAGE_MONITORING
    uint32_t total_us_executing = 0;
    uint32_t total_us_idling = 0;

    // calculate core usage
    for (uint8_t s = 0; s < CORE_COUNT; s++) {
        scheduler_t* scheduler = &schedulers[s];

        uint32_t us_executing = scheduler->us_executing;
        uint32_t us_idling = scheduler->us_idling;

        total_us_executing += us_executing;
        total_us_idling += us_idling;

        if (us_executing <= 0) {
            scheduler->core_usage = 0;
        }
        else {
            scheduler->core_usage = ((us_executing - us_idling) * 100) / us_executing;
        }

        scheduler->us_idling = 0;
        scheduler->us_executing = 0;
    }

    // calculate task cpu usage
    for (int t = 0; t < MAX_TASKS; t++) {
        task_t* task = &tasks[t];

        if (task->state == TASK_FREE) {
            continue;
        }

        task->cpu_usage = (task->us_executing * 100) / total_us_executing;
        task->us_executing = 0;
    }
#else
    uint32_t total_ticks_executing = 0;
    uint32_t total_ticks_idling = 0;

    // calculate core usage
    for (uint8_t s = 0; s < CORE_COUNT; s++) {
        scheduler_t* scheduler = &schedulers[s];

        uint32_t ticks_executing = scheduler->ticks_executing;
        uint32_t ticks_idling = scheduler->ticks_idling;

        total_ticks_executing += ticks_executing;
        total_ticks_idling += ticks_idling;

        if (ticks_executing <= 0) {
            scheduler->core_usage = 0;
        }
        else {
            scheduler->core_usage = ((ticks_executing - ticks_idling) * 100) / ticks_executing;
        }

        scheduler->ticks_idling = 0;
        scheduler->ticks_executing = 0;
    }

    // calculate task cpu usage
    for (int t = 0; t < MAX_TASKS; t++) {
        task_t* task = &tasks[t];

        if (task->state == TASK_FREE) {
            continue;
        }

        task->cpu_usage = (task->ticks_executing * 100) / total_ticks_executing;
        task->ticks_executing = 0;
    }
#endif

    scheduler_spin_unlock(saved_irq);
}

uint8_t get_core_usage(const uint8_t core_num) {
    if (core_num >= NUM_CORES) {
        return 0; // it doesn't exist, thus it has no usage
    }

    uint32_t saved_irq = scheduler_spin_lock();

    scheduler_t* scheduler = &schedulers[core_num];
    const uint8_t usage = scheduler->core_usage;

    scheduler_spin_unlock(saved_irq);

    return usage;
}

void heap_dump() {
    printf("\nStack Dump: (Time: %llu ", time_us_64() / 1000LLU);
    // go through all tasks and dump their stack locations and sizes as well as some other memory data
    for (uint32_t t = 0; t < MAX_TASKS; t++) {
        task_t* task = &tasks[t];
        if (task->state == TASK_FREE) {
            continue;
        }
        printf("(Task: %lu, Top: %p, Base: %p, SP: %p)", task->id, task->stack, task->stack_base, task->stack_pointer);
    }
    printf(")\n");
}

uint32_t resize_stack(task_t* task, uint32_t new_size) {
#if PROFILE_SCHEDULER
    profile.ran_stack_resize = true;
#endif
#if DUMP_STACKS
    heap_dump();
#endif
#if DYNAMIC_STACK

    if (new_size > MAX_STACK_SIZE) {
        new_size = MAX_STACK_SIZE;
    }

    if (new_size < MIN_STACK_SIZE) {
        new_size = MIN_STACK_SIZE;
    }

    uint32_t stack_pointer_offset = task->stack_base - task->stack_pointer;
    uint32_t old_size = task->stack_size;

    uint32_t* reallocated_stack = NULL;

    if (new_size > old_size) {
        reallocated_stack = realloc(task->stack, new_size * sizeof(uint32_t));

        if (reallocated_stack == NULL) {
            return old_size; // if its null, that means there was no more room
        }

        task->stack = reallocated_stack;
        task->stack_size = new_size;

        const uint32_t additional_space = new_size - old_size;

        memmove(&task->stack[additional_space], &task->stack[0], old_size * sizeof(uint32_t));

        // fill the rest of the new stack with the filler
        for (uint32_t i = 0; i < additional_space; i++) {
            task->stack[i] = STACK_FILLER;
        }
    } else if (new_size < old_size) {
        reallocated_stack = malloc(new_size * sizeof(uint32_t));

        if (reallocated_stack == NULL) {
            return old_size; // if its null, that means there was no more room
        }

        const uint32_t reduction = old_size - new_size;
        
        memmove(reallocated_stack, &task->stack[reduction], new_size * sizeof(uint32_t));

        free(task->stack);
        task->stack = reallocated_stack;
        task->stack_size = new_size;
    }

    task->stack_base = task->stack + task->stack_size - 1;
    task->stack_pointer = task->stack_base - stack_pointer_offset;
#if OPTIMIZE_STACK_MONITORING
    task->stack_hwm = 0;
#endif

#if PRINT
    printf("\nResizing stack took: %llu us\n", time_us_64() - start_time);
#endif
#if DUMP_STACKS
    heap_dump();
#endif
    return new_size;

#else
    return task->stack_size;
#endif
}

