WolfBoy55014/RP2040-Scheduler/src/scheduler.c
bool find_and_flag_stack_overflow(task_t* task) {
    uint32_t* check_point = task->stack + STACK_OVERFLOW_THRESHOLD - 1;

    if (*check_point != STACK_FILLER) {
#if DYNAMIC_STACK
        task->state = TASK_STACK_OVERFLOWED;
#else
        task->state = TASK_SUSPENDED;
#endif
        return false;
    }

    return true;
}

void calculate_stack_usage() {
    const uint32_t saved_irq = scheduler_spin_lock();

    for (uint32_t t = 0; t < MAX_TASKS; t++) {
        task_t* task = &tasks[t];

        if (task->state == TASK_FREE || task->state == TASK_RUNNING) {
            continue;
        }

#if OPTIMIZE_STACK_MONITORING
        if (task->state == TASK_SUSPENDED) {
            continue;
        }

        if (task->stack_recalculate_cooldown > 0) {
            task->stack_recalculate_cooldown--;
            continue;
        }
#endif

        uint32_t total_stack = task->stack_size;
#if OPTIMIZE_STACK_MONITORING
        uint32_t starting_index = task->stack_hwm;
#else
        uint32_t starting_index = 0;
#endif
        uint32_t stack_unused = starting_index;

        for (uint32_t i = starting_index; i < total_stack; i++) {
            // remember, the ARM stack grows downwards!
            if (task->stack[i] == STACK_FILLER) {
                stack_unused++;
            }
            else {
#if OPTIMIZE_STACK_MONITORING
                task->stack_hwm = i - 1;
#endif
                break;  // we started from the side that will be touched last
                        // so if this word was used so will all the rest
            }
        }

        uint32_t stack_used = total_stack - stack_unused;

        task->stack_usage = (stack_used * 100) / total_stack;

#if OPTIMIZE_STACK_MONITORING
        task->stack_recalculate_cooldown = OPTIMIZE_STACK_MONITORING_FACTOR * (stack_unused / STACK_OVERFLOW_THRESHOLD);
        if (task->state == TASK_WAIT_US) {
            task->stack_recalculate_cooldown++;
        }
#endif

        if (stack_unused < STACK_OVERFLOW_THRESHOLD) {
#if DYNAMIC_STACK
            if (task->stack_size < MAX_STACK_SIZE) {
                resize_stack(task, task->stack_size + STACK_STEP_SIZE);
            }
            else {
                task->state = TASK_SUSPENDED;
            }
#else
            task->state = TASK_SUSPENDED;
#endif
        }
    }
#if PRINT
    printf("\nCalculating stack size took: %u us\n", time_us_32() - start_time);
#endif

    scheduler_spin_unlock(saved_irq);
}

void scheduler_garbage_collect() {
    for (uint32_t t = 0; t < MAX_TASKS; t++) {
        task_t* task = &tasks[t];

        // if this task is free, skip
        if (task->state == TASK_FREE) {
            continue;
        }

        // if task is dead, remove it
        if (task->state == TASK_DEAD) {
            free(task->stack);
            task->state = TASK_FREE;
            num_tasks--;
            continue;
        }

        // if the stack wants more memory, allocate more
        if (task->state == TASK_STACK_OVERFLOWED) {
#if DYNAMIC_STACK
            if (task->stack_size < MAX_STACK_SIZE) {
                uint32_t desired_size = task->stack_size + STACK_STEP_SIZE;
                // if the task has specified an amount:
                if (task->requested_stack_size != 0) {
                    desired_size = task->requested_stack_size;
                    task->requested_stack_size = 0;
                }
                uint32_t old_size = task->stack_size;
                uint32_t new_size = resize_stack(task, desired_size);
                if (new_size == desired_size) {
                    task->state = TASK_READY;
                } else {
                    task->state = TASK_SUSPENDED;
                }
            } else {
                task->state = TASK_SUSPENDED;
            }
#else
            task->state = TASK_SUSPENDED;
#endif
        }
    }
}

// TODO: optimize by making it so it only has to loop through existing tasks, not all possible tasks
__attribute__((noinline))
void get_next_task() {
    const uint32_t saved_irq = scheduler_spin_lock();

#if PRINT
    uint32_t start_time = time_us_32();
#endif

    scheduler_t* scheduler = get_scheduler();
    task_t* current_task = scheduler->current_task;
#if CPU_FANCY_USAGE_MONITORING
    uint32_t time_passed = time_us_32() - scheduler->loop_start_us;
    current_task->us_executing += time_passed;
    scheduler->us_executing += time_passed;
    if (current_task->id < CORE_COUNT) {
        scheduler->us_idling += time_passed;
    }
#endif

    int16_t highest_priority = -1;

    if (current_task->state == TASK_RUNNING) {
        current_task->state = TASK_READY; // tell scheduler that the old task is not running anymore
        // when we move to dual-core, this will be useful
    }

    if (current_task->state == TASK_ZOMBIE) {
        current_task->state = TASK_DEAD;
    }

    uint32_t potential_index = scheduler->current_task_index;
    absolute_time_t now = get_absolute_time();

    for (uint32_t t = 0; t < MAX_TASKS; t++) {
        potential_index++;

        if (potential_index >= MAX_TASKS) {
            potential_index = 0;
        }

        task_t* potential_task = &tasks[potential_index];

        // if this task is not usable, skip
        if (potential_task->state == TASK_FREE ||
            potential_task->state == TASK_DEAD ||
            potential_task->state == TASK_STACK_OVERFLOWED ||
            potential_task->state == TASK_SUSPENDED) {
            continue;
        }

        // see if the required time has passed for this task, if it was waiting
        if (potential_task->state == TASK_WAIT_US) {
            if (absolute_time_diff_us(now, potential_task->resume_us) <= 0) {
                potential_task->state = TASK_READY;
            }
        }

        // if this task has the highest priority found so far, select it
        if ((potential_task->state == TASK_READY) && (potential_task->priority > highest_priority)) {
            if (find_and_flag_stack_overflow(potential_task)) {
                highest_priority = potential_task->priority;
                scheduler->current_task_index = potential_index;
                scheduler->current_task = potential_task;
            }
        }

        // if this task was yielding, reset it to ready
        // this is done after the task is chosen, as if a high priority task yields
        // we want to run a lower priority task before running the high priority one again
        if (potential_task->state == TASK_YIELDING) {
            potential_task->state = TASK_READY;
        }
    }
#if PRINT
    printf("Finding next task took: %lu us\n", time_us_32() - start_time);
    printf("Loading task id: %lu\n", scheduler->current_task->id);
#endif
    scheduler->current_task->state = TASK_RUNNING; // tell scheduler that the new task is running
#if CPU_FANCY_USAGE_MONITORING
    scheduler->loop_start_us = time_us_32();
#endif

    scheduler_spin_unlock(saved_irq);
}

__attribute__((noinline))
void isr_hardfault(void) {
#if DUMP_STACKS
    heap_dump();
#endif
#if STATUS_LED
    gpio_init(STATUS_LED_PIN);
    gpio_set_dir(STATUS_LED_PIN, GPIO_OUT);
    gpio_put(STATUS_LED_PIN, false);
#endif
    asm("bkpt");
}

