WolfBoy55014/RP2040-Scheduler/src/scheduler.c
void refresh_systick_on_clock_change() {
    const uint32_t clock_hz = clock_get_hz(clk_sys);
    const uint32_t ticks = (clock_hz * LOOP_TIME) / 1000;

    // set when the timer should fire based on new clock speed
    systick_hw->rvr = ticks - 1;

    // reset systick to zero
    systick_hw->cvr = 0;
}

void refresh_systick_all_cores() {
    // update the systick on this core
    refresh_systick_on_clock_change();

#if CORE_COUNT > 1
    // signal the other core to do the same
    multicore_fifo_push_blocking(MULTICORE_SIG_UPDATE_SYSTICK);

    // wait for a response from the other core
    multicore_fifo_pop_blocking();
#endif
}

#if CORE_COUNT > 1
void check_multicore_signals() {
    if (multicore_fifo_rvalid()) {
        uint32_t cmd = multicore_fifo_pop_blocking();

        if (cmd == MULTICORE_SIG_UPDATE_SYSTICK) {
            refresh_systick_on_clock_change();
            // acknowledge
            multicore_fifo_push_blocking(MULTICORE_SIG_ACKNOWLEDGE);
        }
    }
}
#endif

void scheduler_raise_pendsv() {
    *(volatile uint32_t*)(0xe0000000 | M0PLUS_ICSR_OFFSET) = (1L << 28);
}

__attribute__((noinline))
void isr_systick(void) {
#if PROFILE_SCHEDULER
    profile.ran_channel_collection = false;
    profile.ran_schedular_collection = false;
    profile.ran_cpu_usage = false;
    profile.ran_governor = false;
    profile.ran_stack_resize = false;
    profile.ran_stack_usage = false;

    profile.start_us = time_us_64();
#endif

#if CORE_COUNT > 1
    // read and handle signals from other core
    check_multicore_signals();
#endif

    scheduler_t* scheduler = get_scheduler();
#if !CPU_FANCY_USAGE_MONITORING
    scheduler->ticks_executing++;
    task_t* task = get_current_task();

    if (task->id < CORE_COUNT) {
        scheduler->ticks_idling++;
    }

    task->ticks_executing++;
#endif

    if (CORE_NUM == 0) {
        if ((scheduler->ticks_since_start % STACK_MONITOR_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_stack_usage = true;
#endif
            calculate_stack_usage();
        }
        if ((scheduler->ticks_since_start % CHANNEL_GARBAGE_COLLECT_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_channel_collection = true;
#endif
            channel_garbage_collect();
        }
        if ((scheduler->ticks_since_start % CPU_USAGE_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_cpu_usage = true;
#endif
            calculate_cpu_usage();
        }
        if ((scheduler->ticks_since_start % SCHEDULER_GARBAGE_COLLECT_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_schedular_collection = true;
#endif
            scheduler_garbage_collect();
        }
#if USE_GOVERNOR
        if ((scheduler->ticks_since_start % GOVERNOR_PERIOD) == 0) {
#if PROFILE_SCHEDULER
            profile.ran_governor = true;
#endif
            governor_update();
        }
#endif
    }

#if PROFILE_SCHEDULER
    profile.end_us = time_us_64();

    printf("\ntime: %llu, su: %u, sr: %u, sc: %u, cc: %u, cu: %u, cg: %u\n", profile.end_us - profile.start_us,
           profile.ran_stack_usage, profile.ran_stack_resize, profile.ran_schedular_collection,
           profile.ran_channel_collection, profile.ran_cpu_usage, profile.ran_governor);
#endif

    scheduler->ticks_since_start++;

    // raise PendSV interrupt (handler in assembly!)
    scheduler_raise_pendsv();
}

void start_systick() {
    const uint32_t clock_hz = clock_get_hz(clk_sys);
    const uint32_t ticks = (clock_hz * LOOP_TIME) / 1000; // loop time in ms

    // configure SysTick
    systick_hw->rvr = ticks - 1; // set ticks until fire
    systick_hw->cvr = 0; // clear current value
    systick_hw->csr = M0PLUS_SYST_CSR_CLKSOURCE_BITS | // use system clock
        M0PLUS_SYST_CSR_TICKINT_BITS | // enable interrupt
        M0PLUS_SYST_CSR_ENABLE_BITS; // enable SysTick
}

__attribute__((noinline))
void remove_task(task_t* task) {
    const uint32_t saved_irq = scheduler_spin_lock();

    // we make it a zombie until it stops running to prevent from freeing
    // the stack from another core while it is still running
    if (task->state == TASK_RUNNING) {
        task->state = TASK_ZOMBIE;
    }
    else {
        task->state = TASK_DEAD;
        num_tasks--;
    }
    scheduler_spin_unlock(saved_irq);

    scheduler_raise_pendsv();
}

__attribute__((noinline))
void task_return() {
    remove_task(get_current_task());
}

__attribute__((noinline))
kelp_error_t task_add_args(void (*task_function)(uint32_t, uint32_t*, char*), const uint32_t id, char* args,
                      const uint8_t priority) {
    // Acquire lock for initial checks
    const uint32_t saved_irq = scheduler_spin_lock();

    if (num_tasks >= MAX_TASKS) {
        PRINT_WARNING("No more open tasks.\n");
        scheduler_spin_unlock(saved_irq);
        return KELP_NONE_FREE; // no more slots empty
    }

    if (task_exists_no_lock(id)) {
        PRINT_WARNING("Task id already taken.\n");
        scheduler_spin_unlock(saved_irq);
        return KELP_ID_TAKEN; // id taken
    }

    task_t* task = NULL;

    // find available task slot
    for (int t = 0; t < MAX_TASKS; t++) {
        if (tasks[t].state == TASK_FREE) {
            task = &tasks[t];
            break;
        }
    }

    if (task == NULL) {
        scheduler_spin_unlock(saved_irq);
        return KELP_NONE_FREE; // mo more room for tasks
    }

    task->state = TASK_CLAIMED;

    // release lock before expensive operations
    scheduler_spin_unlock(saved_irq);

    task->stack_usage = 0;
    task->cpu_usage = 0;
#if CPU_FANCY_USAGE_MONITORING
    task->us_executing = 0;
#else
    task->ticks_executing = 0;
#endif
#if OPTIMIZE_STACK_MONITORING
    task->stack_recalculate_cooldown = 0;
#endif
    task->id = id;
    task->priority = priority;

#if DYNAMIC_STACK
    const uint32_t stack_size = STARTING_STACK_SIZE;
#else
    const uint32_t stack_size = STACK_SIZE;
#endif
    task->stack = (uint32_t*)malloc(stack_size * sizeof(uint32_t)); // dynamically get stack from heap

    if (task->stack == NULL) {
        return KELP_MEMORY;
    }

    task->stack_size = stack_size; // in 32bit words
    task->stack_base = task->stack + task->stack_size - 1; // highest value in stack (where the sp starts)
#if OPTIMIZE_STACK_MONITORING
    task->stack_hwm = 0;
#endif

    // fill stack with known values for stack monitoring
    for (uint32_t i = 0; i < stack_size; i++) {
        task->stack[i] = STACK_FILLER;
    }

    // save current stack pointer position
    task->stack_pointer = task->stack_base;

    // insert arguments
    uint32_t args_size = strlen(args) + 1;
    uint32_t args_size_uint32 = (args_size + 3) / 4;
    char* args_in_stack = (char*)(task->stack_base - args_size_uint32);

    args_in_stack[args_size] = '\0';
    for (uint32_t i = 0; i < args_size; i++) {
        args_in_stack[i] = args[i];
    }

    task->stack_pointer -= args_size_uint32 + 1;

    // set up initial stack frame for context switching
    *(task->stack_pointer--) = (uint32_t)0x01000000; // PSR (Thumb bit set)
    *(task->stack_pointer--) = (uint32_t)task_function; // PC (where to start)
    *(task->stack_pointer--) = (uint32_t)task_return; // LR (return address)
    *(task->stack_pointer--) = 12; // R12
    *(task->stack_pointer--) = args_size; // R3
    *(task->stack_pointer--) = (uint32_t)args_in_stack; // R2 (pointer to args)
    *(task->stack_pointer--) = (uint32_t)&task->signals; // R1 (pass signals to task)
    *(task->stack_pointer--) = task->id; // R0 (pass id to task)

    // I'm leaving these here as a testimony of frustration
    // These are pushed by C onto the stack upon entering the interrupt handler
    // They would be an issue, except for the fact I'm now using the dual-stack-pointer
    // functionality of the Cortex-M0, so they are pushed onto the MSP stack, not the process stack.
    // I hope...
    // *(task.stack_pointer--) = (uint32_t)task_function; // LR (C decided to push these! :( )
    // *(task.stack_pointer--) = 0;           // R4

    *(task->stack_pointer--) = 7; // R7
    *(task->stack_pointer--) = 6; // R6
    *(task->stack_pointer--) = 5; // R5
    *(task->stack_pointer--) = 4; // R4
    *(task->stack_pointer--) = 11; // R11
    *(task->stack_pointer--) = 10; // R10
    *(task->stack_pointer--) = 9; // R9
    *(task->stack_pointer) = 8; // R8

    task->state = TASK_READY;

    num_tasks++;
    return KELP_OK;
}

kelp_error_t task_add(void (*task_function)(uint32_t, uint32_t*, char*), const uint32_t id, const uint8_t priority) {
    return task_add_args(task_function, id, "\0", priority);
}

__attribute__((noinline))
void idle_task(uint32_t pid, uint32_t* signals, char* args) {
    while (true) {
        __wfi();
    }
}

