WolfBoy55014/RP2040-Scheduler/src/scheduler.c
void scheduler_start_this_core() {
    task_add(idle_task, 0 + CORE_NUM, 0);
    scheduler_t* scheduler = get_scheduler();
#if CPU_FANCY_USAGE_MONITORING
    scheduler->us_executing = 0;
#else
    scheduler->ticks_executing = 0;
#endif
    scheduler->ticks_since_start = 0;

    NVIC_SetPriority(PendSV_IRQn, 0xFF);
    NVIC_SetPriority(SysTick_IRQn, 2);

    if (num_tasks == 0) {
        PRINT_WARNING("No tasks to run\n");
        return; // no tasks
    }

    PRINT_DEBUG("Starting Scheduler\n");

    get_next_task();

    PRINT_DEBUG("Adding Timer...\n");

    start_systick();

    PRINT_DEBUG("Timer Started!\n");

    set_spsel(2);
}

kelp_error_t kernel_start() {
#if STATUS_LED
    gpio_init(STATUS_LED_PIN);
    gpio_set_dir(STATUS_LED_PIN, GPIO_OUT);
    gpio_put(STATUS_LED_PIN, true);
#endif
    spin_locks_init();
#if CORE_COUNT > 1
    multicore_reset_core1();
    multicore_launch_core1(scheduler_start_this_core);
#endif
    scheduler_start_this_core();
    return 0;
}

/* Task Functions */

void task_sleep_ms(uint32_t ms) {
    if (ms > (UINT32_MAX / 1000)) {
        task_sleep_us(UINT32_MAX);
        return;
    }

    task_sleep_us(ms * 1000);
}

void task_sleep_us(uint64_t us) {
    if (us == 0) {
        task_yield();
        return;
    }

    const uint32_t saved_irq = scheduler_spin_lock();
    task_t* current_task = get_current_task();
    current_task->state = TASK_WAIT_US;
    current_task->resume_us = make_timeout_time_us(us);
    scheduler_spin_unlock(saved_irq);
    scheduler_raise_pendsv();
}

void task_yield() {
    const uint32_t saved_irq = scheduler_spin_lock();
    task_t* current_task = get_current_task();
    current_task->state = TASK_YIELDING;
    scheduler_spin_unlock(saved_irq);
    scheduler_raise_pendsv();
}

kelp_error_t task_request_stack(uint32_t stack_size) {
    const uint32_t saved_irq = scheduler_spin_lock();
    task_t* current_task = get_current_task();
    current_task->state = TASK_STACK_OVERFLOWED;
    current_task->requested_stack_size = stack_size;
    scheduler_spin_unlock(saved_irq);
    scheduler_raise_pendsv();

    if (current_task->stack_size == stack_size) {
        return KELP_OK;
    }

    return KELP_ERROR;
}

void task_end(int32_t code) {
    task_return();
}

bool task_exists_no_lock(uint32_t pid) {
    for (uint32_t i = 0; i < MAX_TASKS; i++) {
        if (tasks[i].id == pid && tasks[i].state != TASK_FREE) {
            return true; // id exists
        }
    }

    return false;
}

bool task_exists(uint32_t pid) {
    const uint32_t saved_irq = scheduler_spin_lock();

    bool exists = task_exists_no_lock(pid);

    scheduler_spin_unlock(saved_irq);
    return exists;
}

void task_signal(uint32_t pid, uint32_t signals) {
    task_t* task = NULL;

    const uint32_t saved_irq = scheduler_spin_lock();
    for (uint32_t i = 0; i < MAX_TASKS; i++) {
        if (tasks[i].id == pid && tasks[i].state != TASK_FREE) {
            task = &tasks[i];
            break;
        }
    }

    if (task == NULL) {
        scheduler_spin_unlock(saved_irq);
        return;
    }

    task->signals |= signals;

    scheduler_spin_unlock(saved_irq);
}
